# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [45]:
# your code here
import numpy as np
import pandas as pd

### 2. Create a Pandas Series containing the elements of the list below.

In [46]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]
print(lst)

[5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [47]:
# your code here
my_series = pd.Series(lst)
my_series

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [48]:
# your code here
my_series[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [49]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [50]:
# your code here
df = pd.DataFrame(data = b)
df
df.describe()

              0         1          2          3          4
count  10.00000  10.00000  10.000000  10.000000  10.000000
mean   54.62000  50.11000  56.950000  47.280000  63.250000
std    25.64899  32.12204  30.168278  31.393446  24.562313
min    20.60000   0.10000   0.100000   4.200000  26.900000
25%    32.95000  29.55000  43.450000  25.050000  39.450000
50%    55.25000  40.75000  53.600000  36.400000  69.000000
75%    70.60000  72.15000  80.925000  79.300000  85.300000
max    96.60000  96.40000  96.100000  88.800000  91.800000

### 5. Rename the data frame columns based on the names in the list below.

In [51]:
c = [["Score_1"],
     ["Score_2"],
     ["Score_3"],
     ["Score_4"],
     ["Score_5"],
     ["Score_6"],
     ["Score_7"],
     ["Score_8"],
     ["Score_9"],
     ["Score_10"]]

In [52]:
# your code here
df.columns =["Score_1", "Score_2", "Score_3", "Score_4", "Score_5"]
df.head()
df.info()
df.head(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Score_1  10 non-null     float64
 1   Score_2  10 non-null     float64
 2   Score_3  10 non-null     float64
 3   Score_4  10 non-null     float64
 4   Score_5  10 non-null     float64
dtypes: float64(5)
memory usage: 532.0 bytes

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [53]:
# your code here
df.iloc[:, [0, 2, 4]]  # cojo todas las filas (:), pero solo las columnas con indice 0 2 y 4

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [54]:
# your code here
df.Score_3.mean()

56.95000000000001

In [55]:
df["Score_3"].mean()

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [56]:
# your code here
df.Score_4.max()

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [57]:
# your code here
df["Score_2"].median()

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [58]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [59]:
# your code here
df = pd.DataFrame(data = orders)
# df = pd.DataFrame(orders) // es lo mismo
df

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [60]:
# your code here
total_quantity = df["Quantity"].sum()
total_quantity
total_revenue = df["Revenue"].sum()
total_revenue
print("Total quantity:", total_quantity)
print("Total revenue:", total_revenue)

Total quantity: 2978
Total revenue: 637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [61]:
# your code here
most_expensive = df["UnitPrice"].max()
most_expensive
df[df["UnitPrice"] == most_expensive] # hay alguna manera de saltar el paso donde se guarda el max en una variable??

                      Description  Quantity  UnitPrice  Revenue
6  BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95

In [62]:
df.loc[df["UnitPrice"] == most_expensive, "Description"]
df.loc[df["UnitPrice"] == most_expensive, ["Description"]] # lo muestra más visual

                      Description
6  BOX OF VINTAGE ALPHABET BLOCKS

In [63]:
df[df["UnitPrice"] == most_expensive]["Description"]

6    BOX OF VINTAGE ALPHABET BLOCKS
Name: Description, dtype: object

In [64]:
least_expensive = df["UnitPrice"].min()
least_expensive
df[df["UnitPrice"] == least_expensive]

                         Description  Quantity  UnitPrice  Revenue
3  WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18    518.4

In [65]:
df.loc[df["UnitPrice"] == least_expensive, "Description"]

3    WORLD WAR 2 GLIDERS ASSTD DESIGNS
Name: Description, dtype: object

In [67]:
df.loc[df["UnitPrice"] == least_expensive, ["Description"]]

                         Description
3  WORLD WAR 2 GLIDERS ASSTD DESIGNS

In [68]:
difference = most_expensive - least_expensive
print(f"la diferencia es de {difference} euros")

la diferencia es de 11.77 euros